Made docs diagrams more readable
